{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "AutoPrefixTool",
			"Children": [
				{
					"Source": {
						"Text": "  操作"
					},
					"Translation": {
						"Text": "  操作"
					},
					"Key": "ColOp"
				},
				{
					"Source": {
						"Text": "+ 添加规则"
					},
					"Translation": {
						"Text": "+ 添加规则"
					},
					"Key": "AddRuleBtn"
				},
				{
					"Source": {
						"Text": "丢弃当前修改，从 JSON 重新读取全部配置"
					},
					"Translation": {
						"Text": "丢弃当前修改，从 JSON 重新读取全部配置"
					},
					"Key": "ReloadBtnTip"
				},
				{
					"Source": {
						"Text": "从 JSON 中删除这套前缀"
					},
					"Translation": {
						"Text": "从 JSON 中删除这套前缀"
					},
					"Key": "DeleteSetBtnTip"
				},
				{
					"Source": {
						"Text": "从项目设置读取"
					},
					"Translation": {
						"Text": "从项目设置读取"
					},
					"Key": "PullBtn"
				},
				{
					"Source": {
						"Text": "使用方法：\n  1. 在下方规则表里选择 目标类 及其 前缀\n  2. 填好表后可点击 保存配置 保存当前配置\n  3. 点 应用到项目设置 把当前这套写进 DefaultGame.ini 并生效\n  4. 之后新建蓝图/资产时，重命名输入框的默认值就会变成对应前缀\n  5. 改乱了可点 重置默认值 ，把当前配置恢复为默认前缀（需再点 应用到项目设置 才生效）\n  6. 本插件只接管蓝图/资产的前缀；C++ 类保持引擎原生"
					},
					"Translation": {
						"Text": "使用方法：\n  1. 在下方规则表里选择 目标类 及其 前缀\n  2. 填好表后可点击 保存配置 保存当前配置\n  3. 点 应用到项目设置 把当前这套写进 DefaultGame.ini 并生效\n  4. 之后新建蓝图/资产时，重命名输入框的默认值就会变成对应前缀\n  5. 改乱了可点 重置默认值 ，把当前配置恢复为默认前缀（需再点 应用到项目设置 才生效）\n  6. 本插件只接管蓝图/资产的前缀；C++ 类保持引擎原生"
					},
					"Key": "AutoPrefixHelp"
				},
				{
					"Source": {
						"Text": "保存配置"
					},
					"Translation": {
						"Text": "保存配置"
					},
					"Key": "SaveSetBtn"
				},
				{
					"Source": {
						"Text": "删除"
					},
					"Translation": {
						"Text": "删除"
					},
					"Key": "DeleteSetBtn"
				},
				{
					"Source": {
						"Text": "删除"
					},
					"Translation": {
						"Text": "删除"
					},
					"Key": "RemoveRuleBtn"
				},
				{
					"Source": {
						"Text": "删除这条规则"
					},
					"Translation": {
						"Text": "删除这条规则"
					},
					"Key": "RemoveRuleBtnTip"
				},
				{
					"Source": {
						"Text": "前缀"
					},
					"Translation": {
						"Text": "前缀"
					},
					"Key": "ColPrefix"
				},
				{
					"Source": {
						"Text": "前缀配置: "
					},
					"Translation": {
						"Text": "前缀配置: "
					},
					"Key": "SetLabel"
				},
				{
					"Source": {
						"Text": "如 BP_"
					},
					"Translation": {
						"Text": "如 BP_"
					},
					"Key": "PrefixHint"
				},
				{
					"Source": {
						"Text": "应用到项目设置"
					},
					"Translation": {
						"Text": "应用到项目设置"
					},
					"Key": "ApplyBtn"
				},
				{
					"Source": {
						"Text": "打开配置文件夹"
					},
					"Translation": {
						"Text": "打开配置文件夹"
					},
					"Key": "OpenFolderBtn"
				},
				{
					"Source": {
						"Text": "把当前配置写入 DefaultGame.ini，更新 项目设置 -> 插件 -> AutoPrefix "
					},
					"Translation": {
						"Text": "把当前配置写入 DefaultGame.ini，更新 项目设置 -> 插件 -> AutoPrefix "
					},
					"Key": "ApplyBtnTip"
				},
				{
					"Source": {
						"Text": "把当前配置的规则恢复为内置默认（常见 UE 命名约定），仅在内存中生效，点 保存配置 可持久化"
					},
					"Translation": {
						"Text": "把当前配置的规则恢复为内置默认（常见 UE 命名约定），仅在内存中生效，点 保存配置 可持久化"
					},
					"Key": "ResetBtnTip"
				},
				{
					"Source": {
						"Text": "把当前配置追加保存到 JSON，同名则覆盖该配置"
					},
					"Translation": {
						"Text": "把当前配置追加保存到 JSON，同名则覆盖该配置"
					},
					"Key": "SaveSetBtnTip"
				},
				{
					"Source": {
						"Text": "把项目设置里现有的配置反向读回面板"
					},
					"Translation": {
						"Text": "把项目设置里现有的配置反向读回面板"
					},
					"Key": "PullBtnTip"
				},
				{
					"Source": {
						"Text": "新建空配置"
					},
					"Translation": {
						"Text": "新建空配置"
					},
					"Key": "NewSetBtn"
				},
				{
					"Source": {
						"Text": "清空当前规则表，从零开始配置一套新的前缀"
					},
					"Translation": {
						"Text": "清空当前规则表，从零开始配置一套新的前缀"
					},
					"Key": "NewSetBtnTip"
				},
				{
					"Source": {
						"Text": "目标类（蓝图填父类 / 资产填资产类型）"
					},
					"Translation": {
						"Text": "目标类（蓝图填父类 / 资产填资产类型）"
					},
					"Key": "ColClass"
				},
				{
					"Source": {
						"Text": "这套前缀保存时使用的名字"
					},
					"Translation": {
						"Text": "这套前缀保存时使用的名字"
					},
					"Key": "SetNameHint"
				},
				{
					"Source": {
						"Text": "配置名称: "
					},
					"Translation": {
						"Text": "配置名称: "
					},
					"Key": "SetNameLabel"
				},
				{
					"Source": {
						"Text": "重新加载"
					},
					"Translation": {
						"Text": "重新加载"
					},
					"Key": "ReloadBtn"
				},
				{
					"Source": {
						"Text": "重置默认值"
					},
					"Translation": {
						"Text": "重置默认值"
					},
					"Key": "ResetBtn"
				}
			]
		},
		{
			"Namespace": "Contexts",
			"Children": [
				{
					"Source": {
						"Text": "SuBaseToolsBox_PluginCommand"
					},
					"Translation": {
						"Text": "SuBaseToolsBox_PluginCommand"
					},
					"Key": "SuBaseToolsBox_PluginCommand"
				}
			]
		},
		{
			"Namespace": "FToolsBoxModule",
			"Children": [
				{
					"Source": {
						"Text": "工具箱"
					},
					"Translation": {
						"Text": "工具箱"
					},
					"Key": "ToolsBox"
				},
				{
					"Source": {
						"Text": "物理摆放生成"
					},
					"Translation": {
						"Text": "物理摆放生成"
					},
					"Key": "PhysicsPlacerSpawnMode"
				},
				{
					"Source": {
						"Text": "详情"
					},
					"Translation": {
						"Text": "详情"
					},
					"Key": "ToolBoxAuthor"
				}
			]
		},
		{
			"Namespace": "Info",
			"Children": [
				{
					"Source": {
						"Text": "关于"
					},
					"Translation": {
						"Text": "关于"
					},
					"Key": "DetailsTitle"
				},
				{
					"Source": {
						"Text": "制作不易，恳求打赏，谢谢喵ฅ^•ﻌ•^ฅ"
					},
					"Translation": {
						"Text": "制作不易，恳求打赏，谢谢喵ฅ^•ﻌ•^ฅ"
					},
					"Key": "Donate"
				},
				{
					"Source": {
						"Text": "前往bilibili"
					},
					"Translation": {
						"Text": "前往bilibili"
					},
					"Key": "GoBilibili"
				},
				{
					"Source": {
						"Text": "前往github"
					},
					"Translation": {
						"Text": "前往github"
					},
					"Key": "GoGithub"
				}
			]
		},
		{
			"Namespace": "MaterialTransferTool",
			"Children": [
				{
					"Source": {
						"Text": "丢弃当前修改，从 JSON 重新读取全部配置"
					},
					"Translation": {
						"Text": "丢弃当前修改，从 JSON 重新读取全部配置"
					},
					"Key": "ReloadBtnTip"
				},
				{
					"Source": {
						"Text": "两者都不勾选：按源材质类型生成（实例→实例，材质类→材质类）。"
					},
					"Translation": {
						"Text": "两者都不勾选：按源材质类型生成（实例→实例，材质类→材质类）。"
					},
					"Key": "CkeckTip"
				},
				{
					"Source": {
						"Text": "从 JSON 中删除这套配置"
					},
					"Translation": {
						"Text": "从 JSON 中删除这套配置"
					},
					"Key": "DeleteConfigBtnTip"
				},
				{
					"Source": {
						"Text": "使用方法：\n  1. 选择需要继承自的母材质或材质实例类\n  2. 内容浏览器中选择一个或多个需要被转移参数值的材质实例或材质类\n  3. 配置可在下拉框保存多套、随时切换；点 开始转移参数 后生成新材质并赋值参数\n"
					},
					"Translation": {
						"Text": "使用方法：\n  1. 选择需要继承自的母材质或材质实例类\n  2. 内容浏览器中选择一个或多个需要被转移参数值的材质实例或材质类\n  3. 配置可在下拉框保存多套、随时切换；点 开始转移参数 后生成新材质并赋值参数\n"
					},
					"Key": "MaterialAttributeTransferHelper"
				},
				{
					"Source": {
						"Text": "例如 /Game/Materials/Generated"
					},
					"Translation": {
						"Text": "例如 /Game/Materials/Generated"
					},
					"Key": "PathHint"
				},
				{
					"Source": {
						"Text": "保存到各自文件夹中"
					},
					"Translation": {
						"Text": "保存到各自文件夹中"
					},
					"Key": "SaveToFolderTip"
				},
				{
					"Source": {
						"Text": "保存配置"
					},
					"Translation": {
						"Text": "保存配置"
					},
					"Key": "SaveConfigBtn"
				},
				{
					"Source": {
						"Text": "删除"
					},
					"Translation": {
						"Text": "删除"
					},
					"Key": "DeleteConfigBtn"
				},
				{
					"Source": {
						"Text": "删除"
					},
					"Translation": {
						"Text": "删除"
					},
					"Key": "RowDelBtn"
				},
				{
					"Source": {
						"Text": "删除这一行映射"
					},
					"Translation": {
						"Text": "删除这一行映射"
					},
					"Key": "RowDelTip"
				},
				{
					"Source": {
						"Text": "开始转移参数"
					},
					"Translation": {
						"Text": "开始转移参数"
					},
					"Key": "RunBtn"
				},
				{
					"Source": {
						"Text": "打开配置"
					},
					"Translation": {
						"Text": "打开配置"
					},
					"Key": "OpenFolderBtn"
				},
				{
					"Source": {
						"Text": "打开配置文件夹"
					},
					"Translation": {
						"Text": "打开配置文件夹"
					},
					"Key": "OpenFolderBtnTip"
				},
				{
					"Source": {
						"Text": "执行日志:"
					},
					"Translation": {
						"Text": "执行日志:"
					},
					"Key": "LogTitle"
				},
				{
					"Source": {
						"Text": "把当前配置追加保存到 JSON，同名则覆盖该配置"
					},
					"Translation": {
						"Text": "把当前配置追加保存到 JSON，同名则覆盖该配置"
					},
					"Key": "SaveConfigBtnTip"
				},
				{
					"Source": {
						"Text": "新建空配置"
					},
					"Translation": {
						"Text": "新建空配置"
					},
					"Key": "NewConfigBtn"
				},
				{
					"Source": {
						"Text": "母材质参数名 (新)"
					},
					"Translation": {
						"Text": "母材质参数名 (新)"
					},
					"Key": "TitleL"
				},
				{
					"Source": {
						"Text": "添加参数行"
					},
					"Translation": {
						"Text": "添加参数行"
					},
					"Key": "AddBtn"
				},
				{
					"Source": {
						"Text": "清空参数行"
					},
					"Translation": {
						"Text": "清空参数行"
					},
					"Key": "ClearBtn"
				},
				{
					"Source": {
						"Text": "清空当前配置，从零开始配置一套新的转移方案"
					},
					"Translation": {
						"Text": "清空当前配置，从零开始配置一套新的转移方案"
					},
					"Key": "NewConfigBtnTip"
				},
				{
					"Source": {
						"Text": "源材质变量名 (旧)"
					},
					"Translation": {
						"Text": "源材质变量名 (旧)"
					},
					"Key": "TitleR"
				},
				{
					"Source": {
						"Text": "生成保存路径: "
					},
					"Translation": {
						"Text": "生成保存路径: "
					},
					"Key": "PathLabel"
				},
				{
					"Source": {
						"Text": "目标母材质: "
					},
					"Translation": {
						"Text": "目标母材质: "
					},
					"Key": "TargetLabel"
				},
				{
					"Source": {
						"Text": "移除所有映射行"
					},
					"Translation": {
						"Text": "移除所有映射行"
					},
					"Key": "ClearBtnTip"
				},
				{
					"Source": {
						"Text": "获取当前路径"
					},
					"Translation": {
						"Text": "获取当前路径"
					},
					"Key": "GetPathBtn"
				},
				{
					"Source": {
						"Text": "转换后统一生成材质实例"
					},
					"Translation": {
						"Text": "转换后统一生成材质实例"
					},
					"Key": "GenInstChk"
				},
				{
					"Source": {
						"Text": "转换后统一生成材质类"
					},
					"Translation": {
						"Text": "转换后统一生成材质类"
					},
					"Key": "GenMatChk"
				},
				{
					"Source": {
						"Text": "这套配置保存时使用的名字"
					},
					"Translation": {
						"Text": "这套配置保存时使用的名字"
					},
					"Key": "ConfigNameHint"
				},
				{
					"Source": {
						"Text": "配置: "
					},
					"Translation": {
						"Text": "配置: "
					},
					"Key": "ConfigLabel"
				},
				{
					"Source": {
						"Text": "配置名称: "
					},
					"Translation": {
						"Text": "配置名称: "
					},
					"Key": "ConfigNameLabel"
				},
				{
					"Source": {
						"Text": "重新加载"
					},
					"Translation": {
						"Text": "重新加载"
					},
					"Key": "ReloadBtn"
				}
			]
		},
		{
			"Namespace": "PhysicsPlacerTool",
			"Children": [
				{
					"Source": {
						"Text": "+ 添加网格"
					},
					"Translation": {
						"Text": "+ 添加网格"
					},
					"Key": "AddMeshBtn"
				},
				{
					"Source": {
						"Text": "X"
					},
					"Translation": {
						"Text": "X"
					},
					"Key": "OffX"
				},
				{
					"Source": {
						"Text": "Y"
					},
					"Translation": {
						"Text": "Y"
					},
					"Key": "OffY"
				},
				{
					"Source": {
						"Text": "Z"
					},
					"Translation": {
						"Text": "Z"
					},
					"Key": "OffZ"
				},
				{
					"Source": {
						"Text": "不勾选则按列表顺序生成"
					},
					"Translation": {
						"Text": "不勾选则按列表顺序生成"
					},
					"Key": "RandomSpawnTip"
				},
				{
					"Source": {
						"Text": "从生成列表移除该网格"
					},
					"Translation": {
						"Text": "从生成列表移除该网格"
					},
					"Key": "RemoveSpawnTip"
				},
				{
					"Source": {
						"Text": "位置回溯"
					},
					"Translation": {
						"Text": "位置回溯"
					},
					"Key": "RestoreBtn"
				},
				{
					"Source": {
						"Text": "位置回溯（摆位存档）"
					},
					"Translation": {
						"Text": "位置回溯（摆位存档）"
					},
					"Key": "PoseTitle"
				},
				{
					"Source": {
						"Text": "保存当前位置"
					},
					"Translation": {
						"Text": "保存当前位置"
					},
					"Key": "SavePoseBtn"
				},
				{
					"Source": {
						"Text": "保存时使用的名字，可自定义"
					},
					"Translation": {
						"Text": "保存时使用的名字，可自定义"
					},
					"Key": "PoseNameHint"
				},
				{
					"Source": {
						"Text": "停下物理模拟，物体保留在当前（掉落到的）位置"
					},
					"Translation": {
						"Text": "停下物理模拟，物体保留在当前（掉落到的）位置"
					},
					"Key": "StopBtnTip"
				},
				{
					"Source": {
						"Text": "停止模拟"
					},
					"Translation": {
						"Text": "停止模拟"
					},
					"Key": "StopBtn"
				},
				{
					"Source": {
						"Text": "光标检测地面，点击生成物理物体"
					},
					"Translation": {
						"Text": "光标检测地面，点击生成物理物体"
					},
					"Key": "SpawnTip"
				},
				{
					"Source": {
						"Text": "删除存档"
					},
					"Translation": {
						"Text": "删除存档"
					},
					"Key": "DeletePoseBtn"
				},
				{
					"Source": {
						"Text": "可从内容浏览器中拖入添加"
					},
					"Translation": {
						"Text": "可从内容浏览器中拖入添加"
					},
					"Key": "DropHint"
				},
				{
					"Source": {
						"Text": "可多选，勾选框控制是否生成；可从内容浏览器拖入网格"
					},
					"Translation": {
						"Text": "可多选，勾选框控制是否生成；可从内容浏览器拖入网格"
					},
					"Key": "MeshListTip"
				},
				{
					"Source": {
						"Text": "启动模拟"
					},
					"Translation": {
						"Text": "启动模拟"
					},
					"Key": "StartBtn"
				},
				{
					"Source": {
						"Text": "基准偏移(米)"
					},
					"Translation": {
						"Text": "基准偏移(米)"
					},
					"Key": "BaseOffTitle"
				},
				{
					"Source": {
						"Text": "存档名称: "
					},
					"Translation": {
						"Text": "存档名称: "
					},
					"Key": "PoseNameLabel"
				},
				{
					"Source": {
						"Text": "打开配置文件夹"
					},
					"Translation": {
						"Text": "打开配置文件夹"
					},
					"Key": "OpenFolderBtn"
				},
				{
					"Source": {
						"Text": "把列表里物体的 位置/旋转/缩放 记成一份带名字的摆位（同名覆盖，不同名追加）"
					},
					"Translation": {
						"Text": "把列表里物体的 位置/旋转/缩放 记成一份带名字的摆位（同名覆盖，不同名追加）"
					},
					"Key": "SavePoseBtnTip"
				},
				{
					"Source": {
						"Text": "把当前视口里选中的 Actor 加入下方列表"
					},
					"Translation": {
						"Text": "把当前视口里选中的 Actor 加入下方列表"
					},
					"Key": "CaptureBtnTip"
				},
				{
					"Source": {
						"Text": "把选中的那套摆位重新套回当前关卡里标签匹配的物体"
					},
					"Translation": {
						"Text": "把选中的那套摆位重新套回当前关卡里标签匹配的物体"
					},
					"Key": "RestoreBtnTip"
				},
				{
					"Source": {
						"Text": "模拟速度系数: "
					},
					"Translation": {
						"Text": "模拟速度系数: "
					},
					"Key": "SimSpeedLabel"
				},
				{
					"Source": {
						"Text": "正在模拟..."
					},
					"Translation": {
						"Text": "正在模拟..."
					},
					"Key": "SimulatingBtn"
				},
				{
					"Source": {
						"Text": "清空列表"
					},
					"Translation": {
						"Text": "清空列表"
					},
					"Key": "ClearBtn"
				},
				{
					"Source": {
						"Text": "物理摆放工具：\n  1. 进入  生成模式  后，在视口里移动光标会从光标向前检测地面，点击即在该处生成物理物体（带偏移，默认上方 2 米掉落）。Alt+点击不生成。\n  2. 生成模式支持多个网格：从内容浏览器把 StaticMesh 拖到  生成网格列表  即可加入\n  3. 或在视口里框选/点选若干物体对象，点 获取编辑器选中 加入下方列表，再 启动模拟 让它们自由掉落；停止模拟 停下并保留当前位置。\n  4. 模拟前/中/后都可  保存当前位置  记成一份带名字的摆位；不理想时用 位置回溯 返回保存时位置。\n  （物体需带网格等 PrimitiveComponent；模拟时物体会被设为可移动并开启重力）"
					},
					"Translation": {
						"Text": "物理摆放工具：\n  1. 进入  生成模式  后，在视口里移动光标会从光标向前检测地面，点击即在该处生成物理物体（带偏移，默认上方 2 米掉落）。Alt+点击不生成。\n  2. 生成模式支持多个网格：从内容浏览器把 StaticMesh 拖到  生成网格列表  即可加入\n  3. 或在视口里框选/点选若干物体对象，点 获取编辑器选中 加入下方列表，再 启动模拟 让它们自由掉落；停止模拟 停下并保留当前位置。\n  4. 模拟前/中/后都可  保存当前位置  记成一份带名字的摆位；不理想时用 位置回溯 返回保存时位置。\n  （物体需带网格等 PrimitiveComponent；模拟时物体会被设为可移动并开启重力）"
					},
					"Key": "Help"
				},
				{
					"Source": {
						"Text": "物理摆放模拟"
					},
					"Translation": {
						"Text": "物理摆放模拟"
					},
					"Key": "SimRealtimeOverride"
				},
				{
					"Source": {
						"Text": "物理模拟"
					},
					"Translation": {
						"Text": "物理模拟"
					},
					"Key": "SimTitle"
				},
				{
					"Source": {
						"Text": "生成模式"
					},
					"Translation": {
						"Text": "生成模式"
					},
					"Key": "SpawnTitle"
				},
				{
					"Source": {
						"Text": "生成网格列表"
					},
					"Translation": {
						"Text": "生成网格列表"
					},
					"Key": "MeshListTitle"
				},
				{
					"Source": {
						"Text": "生成选项"
					},
					"Translation": {
						"Text": "生成选项"
					},
					"Key": "SpawnOptTitle"
				},
				{
					"Source": {
						"Text": "移除"
					},
					"Translation": {
						"Text": "移除"
					},
					"Key": "RemoveActorBtn"
				},
				{
					"Source": {
						"Text": "移除"
					},
					"Translation": {
						"Text": "移除"
					},
					"Key": "RemoveSpawnBtn"
				},
				{
					"Source": {
						"Text": "获取编辑器选中"
					},
					"Translation": {
						"Text": "获取编辑器选中"
					},
					"Key": "CaptureBtn"
				},
				{
					"Source": {
						"Text": "让列表里的物体开启物理、开始自由掉落"
					},
					"Translation": {
						"Text": "让列表里的物体开启物理、开始自由掉落"
					},
					"Key": "StartBtnTip"
				},
				{
					"Source": {
						"Text": "进入后在视口点击地面即生成物理物体；Alt+点击不生成"
					},
					"Translation": {
						"Text": "进入后在视口点击地面即生成物理物体；Alt+点击不生成"
					},
					"Key": "SpawnBtnTip"
				},
				{
					"Source": {
						"Text": "进入生成模式"
					},
					"Translation": {
						"Text": "进入生成模式"
					},
					"Key": "EnterSpawnBtn"
				},
				{
					"Source": {
						"Text": "追加一个默认立方体条目（也可从内容浏览器拖入具体网格）"
					},
					"Translation": {
						"Text": "追加一个默认立方体条目（也可从内容浏览器拖入具体网格）"
					},
					"Key": "AddMeshBtnTip"
				},
				{
					"Source": {
						"Text": "退出生成模式"
					},
					"Translation": {
						"Text": "退出生成模式"
					},
					"Key": "ExitSpawnBtn"
				},
				{
					"Source": {
						"Text": "选择场景物体"
					},
					"Translation": {
						"Text": "选择场景物体"
					},
					"Key": "SelTitle"
				},
				{
					"Source": {
						"Text": "选择存档: "
					},
					"Translation": {
						"Text": "选择存档: "
					},
					"Key": "PoseLabel"
				},
				{
					"Source": {
						"Text": "随机偏移系数: "
					},
					"Translation": {
						"Text": "随机偏移系数: "
					},
					"Key": "RandOffLabel"
				},
				{
					"Source": {
						"Text": "随机生成网格"
					},
					"Translation": {
						"Text": "随机生成网格"
					},
					"Key": "RandomSpawnTxt"
				},
				{
					"Source": {
						"Text": "（给生成位置叠加 ±该值的随机抖动，单位厘米）"
					},
					"Translation": {
						"Text": "（给生成位置叠加 ±该值的随机抖动，单位厘米）"
					},
					"Key": "RandOffUnit"
				}
			]
		},
		{
			"Namespace": "SAAU",
			"Children": [
				{
					"Source": {
						"Text": "为选中的骨骼网格体批量应用动画修饰符"
					},
					"Translation": {
						"Text": "为选中的骨骼网格体批量应用动画修饰符"
					},
					"Key": "AddAnimationModifyDesc"
				},
				{
					"Source": {
						"Text": "批量处理动画修饰符"
					},
					"Translation": {
						"Text": "批量处理动画修饰符"
					},
					"Key": "BatchModTx"
				},
				{
					"Source": {
						"Text": "批量添加"
					},
					"Translation": {
						"Text": "批量添加"
					},
					"Key": "ApplyOnly"
				},
				{
					"Source": {
						"Text": "批量添加动画修饰符并应用"
					},
					"Translation": {
						"Text": "批量添加动画修饰符并应用"
					},
					"Key": "AddAnimationModify"
				},
				{
					"Source": {
						"Text": "批量添加并应用"
					},
					"Translation": {
						"Text": "批量添加并应用"
					},
					"Key": "ApplyFull"
				},
				{
					"Source": {
						"Text": "清空列表"
					},
					"Translation": {
						"Text": "清空列表"
					},
					"Key": "ClearStaged"
				},
				{
					"Source": {
						"Text": "相关操作请在资产（或场景Actor）右键菜单中脚本操作中查看\n 若是没有请自行创建类继承自AssetAction和ActorAction"
					},
					"Translation": {
						"Text": "相关操作请在资产（或场景Actor）右键菜单中脚本操作中查看\n 若是没有请自行创建类继承自AssetAction和ActorAction"
					},
					"Key": "Title"
				},
				{
					"Source": {
						"Text": "确认选择"
					},
					"Translation": {
						"Text": "确认选择"
					},
					"Key": "AddBtn"
				},
				{
					"Source": {
						"Text": "选择: "
					},
					"Translation": {
						"Text": "选择: "
					},
					"Key": "SelectLabel"
				},
				{
					"Source": {
						"Text": "（已选列表）"
					},
					"Translation": {
						"Text": "（已选列表）"
					},
					"Key": "StagedHeader"
				}
			]
		},
		{
			"Namespace": "SBlankTemplateTool",
			"Children": [
				{
					"Source": {
						"Text": "工具空白模版"
					},
					"Translation": {
						"Text": "工具空白模版"
					},
					"Key": "工具空白模版"
				}
			]
		},
		{
			"Namespace": "SImport_MM",
			"Children": [
				{
					"Source": {
						"Text": "/Game/BatchImport/"
					},
					"Translation": {
						"Text": "/Game/BatchImport/"
					},
					"Key": "Hint"
				},
				{
					"Source": {
						"Text": "从已有父材质实例复制并设置贴图参数"
					},
					"Translation": {
						"Text": "从已有父材质实例复制并设置贴图参数"
					},
					"Key": "UseMITip"
				},
				{
					"Source": {
						"Text": "任务日志:"
					},
					"Translation": {
						"Text": "任务日志:"
					},
					"Key": "LogLabel"
				},
				{
					"Source": {
						"Text": "使用方法：\n  1. 选择要导入模型和贴图的文件夹\n  2. 点导入即可\n  还不清楚怎么用可前往作者B站查看使用教程\n"
					},
					"Translation": {
						"Text": "使用方法：\n  1. 选择要导入模型和贴图的文件夹\n  2. 点导入即可\n  还不清楚怎么用可前往作者B站查看使用教程\n"
					},
					"Key": "AutoPrefixHelp"
				},
				{
					"Source": {
						"Text": "使用父材质实例"
					},
					"Translation": {
						"Text": "使用父材质实例"
					},
					"Key": "UseMI"
				},
				{
					"Source": {
						"Text": "保存位置: "
					},
					"Translation": {
						"Text": "保存位置: "
					},
					"Key": "Dst"
				},
				{
					"Source": {
						"Text": "创建实例并应用"
					},
					"Translation": {
						"Text": "创建实例并应用"
					},
					"Key": "CreateMI"
				},
				{
					"Source": {
						"Text": "前缀:"
					},
					"Translation": {
						"Text": "前缀:"
					},
					"Key": "PrefixLabel"
				},
				{
					"Source": {
						"Text": "勾选时，合并模型拆分后的每个子模型会加上合并模型名作为前缀（如 SM_Chair_Seat）；取消勾选则只保留子模型原名（如 SM_Seat）"
					},
					"Translation": {
						"Text": "勾选时，合并模型拆分后的每个子模型会加上合并模型名作为前缀（如 SM_Chair_Seat）；取消勾选则只保留子模型原名（如 SM_Seat）"
					},
					"Key": "UseCombinedPrefixTip"
				},
				{
					"Source": {
						"Text": "后缀:"
					},
					"Translation": {
						"Text": "后缀:"
					},
					"Key": "SuffixLabel"
				},
				{
					"Source": {
						"Text": "在母材质基础上生成材质实例"
					},
					"Translation": {
						"Text": "在母材质基础上生成材质实例"
					},
					"Key": "CreateMITip"
				},
				{
					"Source": {
						"Text": "如果使用自己自定义的材质球，请根据对应通道填写参数名"
					},
					"Translation": {
						"Text": "如果使用自己自定义的材质球，请根据对应通道填写参数名"
					},
					"Key": "ToolTip"
				},
				{
					"Source": {
						"Text": "如果纹理贴图不与模型同一层级下，而是处于同级的文件夹内，请输入统一的此文件夹名称。留空则默认贴图与模型同级。 "
					},
					"Translation": {
						"Text": "如果纹理贴图不与模型同一层级下，而是处于同级的文件夹内，请输入统一的此文件夹名称。留空则默认贴图与模型同级。 "
					},
					"Key": "Tip"
				},
				{
					"Source": {
						"Text": "导入"
					},
					"Translation": {
						"Text": "导入"
					},
					"Key": "Run"
				},
				{
					"Source": {
						"Text": "批量导入工具"
					},
					"Translation": {
						"Text": "批量导入工具"
					},
					"Key": "Title"
				},
				{
					"Source": {
						"Text": "拆分模型添加合并模型名前缀"
					},
					"Translation": {
						"Text": "拆分模型添加合并模型名前缀"
					},
					"Key": "UseCombinedPrefix"
				},
				{
					"Source": {
						"Text": "浏览"
					},
					"Translation": {
						"Text": "浏览"
					},
					"Key": "B1"
				},
				{
					"Source": {
						"Text": "清空日志"
					},
					"Translation": {
						"Text": "清空日志"
					},
					"Key": "Clear"
				},
				{
					"Source": {
						"Text": "源文件夹: "
					},
					"Translation": {
						"Text": "源文件夹: "
					},
					"Key": "Src"
				},
				{
					"Source": {
						"Text": "生成通用父材质及实例"
					},
					"Translation": {
						"Text": "生成通用父材质及实例"
					},
					"Key": "CreateGenMat"
				},
				{
					"Source": {
						"Text": "留空则在模型同级目录找贴图"
					},
					"Translation": {
						"Text": "留空则在模型同级目录找贴图"
					},
					"Key": "TexHint"
				},
				{
					"Source": {
						"Text": "自动创建一个带有标准参数(BaseColor, Normal, ORM)的父材质及其对应的实例"
					},
					"Translation": {
						"Text": "自动创建一个带有标准参数(BaseColor, Normal, ORM)的父材质及其对应的实例"
					},
					"Key": "CreateGenMatTip"
				},
				{
					"Source": {
						"Text": "贴图参数名配置"
					},
					"Translation": {
						"Text": "贴图参数名配置"
					},
					"Key": "ParamConfig"
				},
				{
					"Source": {
						"Text": "贴图子文件夹名: "
					},
					"Translation": {
						"Text": "贴图子文件夹名: "
					},
					"Key": "TexFolder"
				},
				{
					"Source": {
						"Text": "资产命名详细规则"
					},
					"Translation": {
						"Text": "资产命名详细规则"
					},
					"Key": "NamingRules"
				},
				{
					"Source": {
						"Text": "输入后缀内容..."
					},
					"Translation": {
						"Text": "输入后缀内容..."
					},
					"Key": "SuffixHint"
				},
				{
					"Source": {
						"Text": "选择路径"
					},
					"Translation": {
						"Text": "选择路径"
					},
					"Key": "B2"
				}
			]
		},
		{
			"Namespace": "SSpawnMaterial",
			"Children": [
				{
					"Source": {
						"Text": "/Game/Materials"
					},
					"Translation": {
						"Text": "/Game/Materials"
					},
					"Key": "DstHint"
				},
				{
					"Source": {
						"Text": "从已有父材质实例复制并设置贴图参数"
					},
					"Translation": {
						"Text": "从已有父材质实例复制并设置贴图参数"
					},
					"Key": "UseMITip"
				},
				{
					"Source": {
						"Text": "任务日志:"
					},
					"Translation": {
						"Text": "任务日志:"
					},
					"Key": "LogLabel"
				},
				{
					"Source": {
						"Text": "使用方法：\n  1. 在内容浏览器中选中一个或多个纹理贴图（除此之外也可以加选一个或多个模型）\n  2. 在下方设置保存路径与生成模式\n  3. 点击「生成材质」按钮（如果选择中包含模型，生成的材质会赋予给对应的模型，前提是模型命名规范）\n"
					},
					"Translation": {
						"Text": "使用方法：\n  1. 在内容浏览器中选中一个或多个纹理贴图（除此之外也可以加选一个或多个模型）\n  2. 在下方设置保存路径与生成模式\n  3. 点击「生成材质」按钮（如果选择中包含模型，生成的材质会赋予给对应的模型，前提是模型命名规范）\n"
					},
					"Key": "Usage"
				},
				{
					"Source": {
						"Text": "使用父材质实例"
					},
					"Translation": {
						"Text": "使用父材质实例"
					},
					"Key": "UseMI"
				},
				{
					"Source": {
						"Text": "保存位置: "
					},
					"Translation": {
						"Text": "保存位置: "
					},
					"Key": "Dst"
				},
				{
					"Source": {
						"Text": "保存到贴图同级目录"
					},
					"Translation": {
						"Text": "保存到贴图同级目录"
					},
					"Key": "SaveNextToTextures"
				},
				{
					"Source": {
						"Text": "创建实例并应用"
					},
					"Translation": {
						"Text": "创建实例并应用"
					},
					"Key": "CreateMI"
				},
				{
					"Source": {
						"Text": "前缀:"
					},
					"Translation": {
						"Text": "前缀:"
					},
					"Key": "PrefixLabel"
				},
				{
					"Source": {
						"Text": "勾选后忽略上方保存位置，材质球保存到选中贴图所在目录"
					},
					"Translation": {
						"Text": "勾选后忽略上方保存位置，材质球保存到选中贴图所在目录"
					},
					"Key": "SaveNextToTexturesTip"
				},
				{
					"Source": {
						"Text": "勾选后忽略上方保存位置，材质球保存到选中贴图所在目录"
					},
					"Translation": {
						"Text": "勾选后忽略上方保存位置，材质球保存到选中贴图所在目录"
					},
					"Key": "SaveNextToTexturesTip2"
				},
				{
					"Source": {
						"Text": "后缀:"
					},
					"Translation": {
						"Text": "后缀:"
					},
					"Key": "SuffixLabel"
				},
				{
					"Source": {
						"Text": "在母材质基础上生成材质实例"
					},
					"Translation": {
						"Text": "在母材质基础上生成材质实例"
					},
					"Key": "CreateMITip"
				},
				{
					"Source": {
						"Text": "如果使用自己自定义的材质球，请根据对应通道填写参数名"
					},
					"Translation": {
						"Text": "如果使用自己自定义的材质球，请根据对应通道填写参数名"
					},
					"Key": "ParamConfigTip"
				},
				{
					"Source": {
						"Text": "批量材质球生成"
					},
					"Translation": {
						"Text": "批量材质球生成"
					},
					"Key": "Title"
				},
				{
					"Source": {
						"Text": "本工具将内容浏览器中选中的纹理贴图，根据文件名关键词自动识别贴图通道类型（基础色 / 法线 / ORM / 粗糙度 / 金属度 / 自发光 / 透明度等），并据此生成材质球。"
					},
					"Translation": {
						"Text": "本工具将内容浏览器中选中的纹理贴图，根据文件名关键词自动识别贴图通道类型（基础色 / 法线 / ORM / 粗糙度 / 金属度 / 自发光 / 透明度等），并据此生成材质球。"
					},
					"Key": "Desc"
				},
				{
					"Source": {
						"Text": "清空日志"
					},
					"Translation": {
						"Text": "清空日志"
					},
					"Key": "Clear"
				},
				{
					"Source": {
						"Text": "生成材质"
					},
					"Translation": {
						"Text": "生成材质"
					},
					"Key": "Generate"
				},
				{
					"Source": {
						"Text": "生成通用父材质及实例"
					},
					"Translation": {
						"Text": "生成通用父材质及实例"
					},
					"Key": "CreateGenMat"
				},
				{
					"Source": {
						"Text": "自动创建一个带有标准参数(BaseColor, Normal, ORM, AO, Roughness, Metallic 等)\n和静态开关的父材质及其对应的实例，供「使用父材质实例」模式使用。"
					},
					"Translation": {
						"Text": "自动创建一个带有标准参数(BaseColor, Normal, ORM, AO, Roughness, Metallic 等)\n和静态开关的父材质及其对应的实例，供「使用父材质实例」模式使用。"
					},
					"Key": "CreateGenMatTip"
				},
				{
					"Source": {
						"Text": "贴图参数名配置"
					},
					"Translation": {
						"Text": "贴图参数名配置"
					},
					"Key": "ParamConfig"
				},
				{
					"Source": {
						"Text": "资产命名详细规则"
					},
					"Translation": {
						"Text": "资产命名详细规则"
					},
					"Key": "NamingRules"
				},
				{
					"Source": {
						"Text": "输入后缀内容..."
					},
					"Translation": {
						"Text": "输入后缀内容..."
					},
					"Key": "SuffixHint"
				},
				{
					"Source": {
						"Text": "选择路径"
					},
					"Translation": {
						"Text": "选择路径"
					},
					"Key": "BrowseDst"
				}
			]
		},
		{
			"Namespace": "Tools",
			"Children": [
				{
					"Source": {
						"Text": "右键菜单操作脚本"
					},
					"Translation": {
						"Text": "右键菜单操作脚本"
					},
					"Key": "ToolDetail_ContextMenu"
				},
				{
					"Source": {
						"Text": "右键菜单操作脚本"
					},
					"Translation": {
						"Text": "右键菜单操作脚本"
					},
					"Key": "ToolTitle_ContextMenu"
				},
				{
					"Source": {
						"Text": "多选两个蓝图的变量（函数，宏等），复制/剪切后一次性粘贴到另一个蓝图"
					},
					"Translation": {
						"Text": "多选两个蓝图的变量（函数，宏等），复制/剪切后一次性粘贴到另一个蓝图"
					},
					"Key": "ToolDetail_VariableCopier"
				},
				{
					"Source": {
						"Text": "常见新蓝图类时自动添加该类前缀"
					},
					"Translation": {
						"Text": "常见新蓝图类时自动添加该类前缀"
					},
					"Key": "ToolDetail_AutoPrefix"
				},
				{
					"Source": {
						"Text": "批量导入模型和材质"
					},
					"Translation": {
						"Text": "批量导入模型和材质"
					},
					"Key": "ToolTitle_Import_MM"
				},
				{
					"Source": {
						"Text": "批量导入模型和材质，同文件下的模型以及附属的纹理贴图会自动连接材质球并赋予模型"
					},
					"Translation": {
						"Text": "批量导入模型和材质，同文件下的模型以及附属的纹理贴图会自动连接材质球并赋予模型"
					},
					"Key": "ToolDetail"
				},
				{
					"Source": {
						"Text": "批量材质球生成"
					},
					"Translation": {
						"Text": "批量材质球生成"
					},
					"Key": "ToolTitle_SpawnMaterial"
				},
				{
					"Source": {
						"Text": "材质属性转移"
					},
					"Translation": {
						"Text": "材质属性转移"
					},
					"Key": "ToolTitle_MaterialTransfer"
				},
				{
					"Source": {
						"Text": "物理摆放"
					},
					"Translation": {
						"Text": "物理摆放"
					},
					"Key": "ToolTitle_PhysicsPlacer"
				},
				{
					"Source": {
						"Text": "自动前缀"
					},
					"Translation": {
						"Text": "自动前缀"
					},
					"Key": "ToolTitle_AutoPrefix"
				},
				{
					"Source": {
						"Text": "蓝图变量批量复制"
					},
					"Translation": {
						"Text": "蓝图变量批量复制"
					},
					"Key": "ToolTitle_VariableCopier"
				},
				{
					"Source": {
						"Text": "选中多个场景物体，启动物理自由掉落摆放，并支持保存/回溯摆位"
					},
					"Translation": {
						"Text": "选中多个场景物体，启动物理自由掉落摆放，并支持保存/回溯摆位"
					},
					"Key": "ToolDetail_PhysicsPlacer"
				},
				{
					"Source": {
						"Text": "选择若干材质球或材质实例并通过变量命名将引用转移到新的材质球或材质实例"
					},
					"Translation": {
						"Text": "选择若干材质球或材质实例并通过变量命名将引用转移到新的材质球或材质实例"
					},
					"Key": "ToolDetail_MaterialTransfer"
				},
				{
					"Source": {
						"Text": "选择若干纹理生成材质球或材质实例并赋予模型"
					},
					"Translation": {
						"Text": "选择若干纹理生成材质球或材质实例并赋予模型"
					},
					"Key": "ToolDetail_SpawnMaterial"
				}
			]
		},
		{
			"Namespace": "ToolsBox",
			"Children": [
				{
					"Source": {
						"Text": "工具名称"
					},
					"Translation": {
						"Text": "工具名称"
					},
					"Key": "SearchHint"
				},
				{
					"Source": {
						"Text": "打开作者页面"
					},
					"Translation": {
						"Text": "打开作者页面"
					},
					"Key": "OpenAuthorURL"
				},
				{
					"Source": {
						"Text": "打开工具"
					},
					"Translation": {
						"Text": "打开工具"
					},
					"Key": "OpenBtn"
				}
			]
		},
		{
			"Namespace": "UICommands",
			"Subnamespaces": [
				{
					"Namespace": "OpenToolsBox_Command",
					"Children": [
						{
							"Source": {
								"Text": "ToolsBox"
							},
							"Translation": {
								"Text": "ToolsBox"
							},
							"Key": "ToolsBox_OpenToolsBox"
						},
						{
							"Source": {
								"Text": "点击打开功能窗口"
							},
							"Translation": {
								"Text": "点击打开功能窗口"
							},
							"Key": "ToolsBox_OpenToolsBox_ToolTip"
						}
					]
				}
			]
		},
		{
			"Namespace": "VariableCopier",
			"Children": [
				{
					"Source": {
						"Text": "{0} ({1})"
					},
					"Translation": {
						"Text": "{0} ({1})"
					},
					"Key": "CatFmt"
				},
				{
					"Source": {
						"Text": "{0} ({1})"
					},
					"Translation": {
						"Text": "{0} ({1})"
					},
					"Key": "CatFmtP"
				},
				{
					"Source": {
						"Text": "事件分发器"
					},
					"Translation": {
						"Text": "事件分发器"
					},
					"Key": "NDisp"
				},
				{
					"Source": {
						"Text": "事件图表"
					},
					"Translation": {
						"Text": "事件图表"
					},
					"Key": "NEnv"
				},
				{
					"Source": {
						"Text": "从待处理区里拿掉这一项"
					},
					"Translation": {
						"Text": "从待处理区里拿掉这一项"
					},
					"Key": "M_DelTip"
				},
				{
					"Source": {
						"Text": "使用方法：\n  1. 两边选择要互相复制的蓝图类（拖动前按住shift为复制，alt为剪切）\n  2. 将要复制或剪切的变量，宏，函数等拖进对方待处理区域内\n  3. 点击 确定 即可生效\n"
					},
					"Translation": {
						"Text": "使用方法：\n  1. 两边选择要互相复制的蓝图类（拖动前按住shift为复制，alt为剪切）\n  2. 将要复制或剪切的变量，宏，函数等拖进对方待处理区域内\n  3. 点击 确定 即可生效\n"
					},
					"Key": "AutoPrefixHelp"
				},
				{
					"Source": {
						"Text": "函数"
					},
					"Translation": {
						"Text": "函数"
					},
					"Key": "NFn"
				},
				{
					"Source": {
						"Text": "刷新"
					},
					"Translation": {
						"Text": "刷新"
					},
					"Key": "RefreshBtn"
				},
				{
					"Source": {
						"Text": "剪切"
					},
					"Translation": {
						"Text": "剪切"
					},
					"Key": "M_Cut"
				},
				{
					"Source": {
						"Text": "变量"
					},
					"Translation": {
						"Text": "变量"
					},
					"Key": "NVar"
				},
				{
					"Source": {
						"Text": "复制"
					},
					"Translation": {
						"Text": "复制"
					},
					"Key": "M_Copy"
				},
				{
					"Source": {
						"Text": "宏"
					},
					"Translation": {
						"Text": "宏"
					},
					"Key": "NMacro"
				},
				{
					"Source": {
						"Text": "待处理（拖到这里的，点确定才生效）："
					},
					"Translation": {
						"Text": "待处理（拖到这里的，点确定才生效）："
					},
					"Key": "PendingTitle"
				},
				{
					"Source": {
						"Text": "把两个面板待处理里的东西真正写进各自蓝图"
					},
					"Translation": {
						"Text": "把两个面板待处理里的东西真正写进各自蓝图"
					},
					"Key": "ConfirmTip"
				},
				{
					"Source": {
						"Text": "清空两个面板的待处理区（不影响蓝图）"
					},
					"Translation": {
						"Text": "清空两个面板的待处理区（不影响蓝图）"
					},
					"Key": "ResetTip"
				},
				{
					"Source": {
						"Text": "确定"
					},
					"Translation": {
						"Text": "确定"
					},
					"Key": "ConfirmBtn"
				},
				{
					"Source": {
						"Text": "移除"
					},
					"Translation": {
						"Text": "移除"
					},
					"Key": "M_Del"
				},
				{
					"Source": {
						"Text": "这一项应用时会剪切（从源蓝图移除）"
					},
					"Translation": {
						"Text": "这一项应用时会剪切（从源蓝图移除）"
					},
					"Key": "M_CutTip"
				},
				{
					"Source": {
						"Text": "这一项应用时会复制（源蓝图保留）"
					},
					"Translation": {
						"Text": "这一项应用时会复制（源蓝图保留）"
					},
					"Key": "M_CopyTip"
				},
				{
					"Source": {
						"Text": "重新扫描两个蓝图，检查内容是否变化"
					},
					"Translation": {
						"Text": "重新扫描两个蓝图，检查内容是否变化"
					},
					"Key": "RefreshTip"
				},
				{
					"Source": {
						"Text": "重置"
					},
					"Translation": {
						"Text": "重置"
					},
					"Key": "ResetBtn"
				}
			]
		}
	]
}